label bdf2:
    "พวกเราเดินเข้ามาในป่าต่อไป แต่เหมือนว่าป่าจะมืดผิดปกติ ดูอันตรายแปลกๆ"
    py "ฉันได้ยินมาว่าป่าBlackDormForestนี้เป็นป่าอันตรายนะ"
    py "ถ้าเราเข้ามาลึกกว่านี้เราจะออกไปไม่ได้นะ"
    py "ฉันว่าอย่าเข้ามาลึกกว่านี้ดีกว่า"
    "ระหว่างที่ฟังอยู่มีบางอย่างออกมาจากในพุ่ม"
    mc "ยุงงั้นหรอ!?"
    py "พูดไม่ทันขาดคำก็ออกมาเลยนะ"
    mc "งั้นก็ช่วยไม่ได้หล่ะนะ"
    ##สู้ Mosquito
    mc "ชั้นว่าอันตรายจริงๆด้วยแฮะ"
    py "ใช่ไหมหล่ะ ชั้นว่าเราอย่าเข้าไปอีกเลยนะ นี่ รีบออกกันเถอะ"
    #choice 
    "เลี้ยวขวา"
    "เดินตรงไป"
    
