label bdf3:
    "พวกเราเดินเข้ามาในป่าต่อไป แต่เหมือนว่าป่าจะมืดผิดปกติ ดูอันตรายแปลกๆ"
    py "นี่นายยังเข้ามาในBlackDormForestอีกหรอ"
    py "ถ้าเราเข้าไปลึกกว่านี้เราจะออกไปไม่ได้นะ ฉันขอบอกไว้ก่อน"
    py "ยิ่งมีตัวอะไรอันตรายๆมาอีก เรารีบออกไปกันเถอะ"
    "จากนั้น ก็มีแมงป่องออกมาจากพุ่มไม้"
    mc "แมงป่อง!?"
    py "ช่วยไม่ได้ ต้องสู้แล้วแหละ"
    #สู้ Scorpion
    mc "ถึงจะอันตราย แต่บอบบางงั้นหรอ?"
    py "เอาจริงๆถ้าประมาทก็แทบจะตายได้เลยนะ"
    py "แต่เราไม่ควรจะเข้าไปมากกว่านี้แล้ว จริงๆนะ อย่าเข้าไปอีกเลยเหอะ"
    #choice 
    "เลี้ยวซ้าย"
    "เดินตรงไป"