label df0:
    # mc = yuuki py = pychan lemon = LEMON
    "รู้ตัวอีกที ผมตื่นขึ้นมาในกระท่อมที่มืดมิดซะแล้ว"
    "ผมพยายามมองไปรอบๆแต่ว่าในห้องนี้แทบจะไม่มีอะไรเลย"
    "ผมนึกถึงหน้าเพื่อนสมัยเด็กของผมที่เล่นด้วยกัน ก่อนที่ครอบครัวผมจะเสียและถูกรับเลี้ยง"
    "เหมือนเธอจะชอบกินน้ำอะไรซักอย่าง ผมผมก็จำได้ลางๆแหละ"
    "ผมพยายามคว้ามือไปหาประตู แต่จู่ๆรอบๆตัวของผมก็เริ่มมีแสงสีฟ้าขึ้นมา"
    "จู่ๆก็มีเด็กผู้หญิงสีฟ้าโผล่ขึ้นมาตรงหน้าของผม"
    show pychan
    py "..."
    "ผมทำหน้านิ่งใส่เพราะผมค่อนข้างชินอะไรแบบนี้อยู่แล้ว เตรียมใจแล้วว่าAIต้องโผล่มา"
    py "นายนี่ดูไม่ตกใจเลยนะ จู่ๆมีผู้หญิงโผล่มาข้างหน้านายแบบนี้ ไม่ตกใจเลยรึไง"
    mc "ผมทำใจมาซักพักแล้วหล่ะ"
    py "แหมน่าเสียดายจัง นึกว่าจะตกใจซะงั้น ปกติมนุษย์เนี่ยเป็นแบบนี้ทุกคนรึป่าวนะ"
    mc "เป็นแค่ผมคนเดียวแหละมั้ง"
    "pychan มองไปรอบๆก่อนจะมองมาทางผม"
    $ pychanname = "Pychan"
    py "ฉันยังไม่ได้แนะนำตัวเลย ฉันเป็นAIที่ส่งมาจากProfessor Hiyajouให้มาดูแลนาย ชื่อของฉันคือPychan"
    py "ชื่อเต็มๆของฉันชื่อRenpychan แต่เหมือนว่าจะเปลี่ยนภายหลัง Professor Hiyajou บอกว่าPychanน่าจะเข้ากว่า"
    mc "ตกใจมากกว่าว่า AI นี่มาถึงขั้นนี้แล้วหรอเนี่ย"
    "ผมตกใจมากกว่าว่านึกว่า AI จะแค่มาไกด์ให้เฉยๆ ดันมีความคิดเป็นของตัวเองด้วยหรอ"
    "Pychan จ้องไปที่อื่นซักพัก"
    py "ก็แน่อยู่แล้ว ฉันถูกส่งมาหานายเพื่อให้นายทำภารกิจได้อย่างราบรื่นยังไงหล่ะ"
    py "ก่อนจะออกไปจากกระท่อมนี้ ฉันจะแนะนำระบบต่อสู้ให้ก่อนละกัน"
    #รูป กรรไกร ค้อน กระดาษ
    py "จริงๆก็ไม่มีอะไรซับซ้อนเลย ก็เป่ายิงฉุบทั่วๆไป"
    py "ถ้าชนะ เราก็จะได้ตีคนเดียว"
    py "ถ้าแพ้ อีกฝั่งก็จะได้ตีคนเดียวเช่นกัน"
    py "แต่ถ้าเสมอ ก็จะออกได้โจมตีทั้ง2ฝั่ง โดยเริ่มจากฝั่งเราก่อน"
    py "ไม่ยากใช่ไหมละ?"
    py "จำเอาไว้หล่ะ ด ว ง คือสิ่งที่สำคัญที่สุดในทุกๆอย่างเลยหล่ะ"
    mc "simple กว่าที่คิดแฮะ"
    mc "ผมยังไม่ได้แนะนำตัวเลย ผม [povname] ยินดีที่ได้รู้จัก"
    py "นั่นก็แค่ codename ของนายเฉยๆนี่ แต่ชั่งมันเถอะ ชั้นรู้อยู่แล้วหล่ะ"
    "อะไรของเธอกันเนี่ย แล้วรู้ได้ไงว่านั่นแค่ codename หน่ะ?"
    "???"
    py "ฉันว่าพวกเราควรออกไปจากที่นี่ก่อนนะ มันมืดอะ"
    mc "ก็จริง"
    #ป่า
    "พวกเราออกมาจากกระท่อม ก็เจอป่ารอบๆ เหมือนProfessor Hiyajouจะส่งมาแถวๆป่าจริงๆด้วย"
    "และผมก็เห็นผู้หญิงคนนึง"
    "เหมือนจะเห็นผมแล้วแฮะ"
    show lemon
    lemon "!"
    "เขามองมาที่ผมซักพัก เหมือนคิดอะไรได้ และก็พูดขึ้นมา"
    lemon "อ่อ คนจากLAB:MEM นี่เอง ก็ว่าไม่เคยเห็นหน้าเลย"
    $ lemonname = "LEMON"
    lemon "ฉัน LEMON บริษัทของฉันเป็น 1 ในบริษัทที่เป็นสปอนเซอร์ให้LAB:MEMหน่ะ"
    lemon "ปกติฉันก็มาทำงานในโลกจำลองแห่งนี้แหละ แต่ทำไมไม่รู้คนส่วนใหญ่เรียกฉันว่า นักทวงหนี้ ก็ไม่รู้"
    mc "ครับผม [povname] ผมว่าจะไปหาฐานของ Hivemind หน่ะไม่ทราบว่ารู้รึป่าวครับ"
    lemon "ไม่ต้องสุภาพก็ได้"
    lemon "นายจะไปหาReineแห่งHivemindเหมือนกันงั้นสิ"
    mc "คุณรู้ได้ยังไงหน่ะ"
    lemon "พอเดาออกหน่ะ เห็นบอกว่าเธอคือหัวหน้ามาเฟียHivemindคนปัจจุบันหน่ะ ได้ยินมาว่าคนก่อนตายไปแล้ว เธอก็เลยมาขึ้นตัวแหน่งแทน"
    lemon "เหมือนว่า Hivemind พอเข้ามาในโลกจำลองนี่ก็โดนขับไล่ออกจากหมู่บ้านใกล้ๆนี่"
    lemon "เพราะเหมือนจะไปควบคุมTrue String ผู้พิทักษ์แห่งป่าแห่งแมลงและทำปั่นป่วนหมู่บ้านหน่ะ"
    py "True string นั่นมันแมลงในตำนานในภารกิจนี่นา"
    mc "คิดว่าน่าจะใช่"
    lemon "มีอะไรงั้นหรอ?"
    mc "ป่าวครับไม่มีอะไรทั้งนั้นแหละ"
    "Lemon ไม่เห็น Pychan งั้นหรอ? ai เขาล่องหนให้แค่ฝ่ายเราเห็นได้ไงหว่า"
    mc "คุณก็จะไปที่Hivemindเหมือนกันหรอ"
    lemon "ใช่ แต่ขอทำธุระบางอย่างแถวนี้ให้เสร็จก่อน"
    lemon "ไหนๆก็ไหนๆแล้ว ช่วยเป็นคู่ซ้อมให้ฉันที"
    mc "pythomon battlesหรอครับ?"
    lemon "ใช่แล้วหล่ะ นายคงจะมาที่นี่ครั้งแรก งั้นฉันจะออมมือให้ซักหน่อยละกัน"
    call df0_fight

label df0_fight:
    lemon "พร้อมแล้วก็เข้ามา!"
    py "จำสิ่งที่ฉันสอนเมื่อกี๊และก็สู้ๆละ!"
#############################################
    $ df0 = True
    $ opp_mon_hp = 500
    $ opp_skill_position1 = ["Peck", "Kick", "Flap"]
    $ opp_skill_dmg_position1 = [95, 99, 0]
    $ oppmonster1 = "Dodo"
#############################################
    call reset
    call hide_all
    scene black with slowdisslove
    call battle_loop
    hide pythomon1 with dissolve
    $ df0 = False
#############################################
    lemon "เก่งใช้ได้นิ สำหรับครั้งแรก"
    py "ไม่เลวนิ สำหรับคนที่เย็นชาอย่างนาย"
    mc "หนวกหูนะ"
    lemon "เฮ้ย ด่าฉันหรอ"
    mc "ป่าวครับ ป่าวแค่พูดลอยๆหน่ะ"
    lemon "ชั่งเหอะ ฉันสนุกมากเลยหล่ะ"
    lemon "Hive หน่ะเดินตรงไปเรื่อยๆก็น่าจะถึงนะ ฉันโดนบอกมาแบบนั้นจริงฉันก็ไม่เคยไปเหมือนกัน"
    mc "อ้าว"
    lemon "ฉันต้องไปทำธุระต่อละ หวังว่าครั้งหน้าซักครั้งจะได้เจอโดยที่เรียกชื่อจริงอีกนะ"
    "lemon เดินจากไป"
    mc "อีก งั้นหรอ"
    py "คนรู้จัก?"
    mc "ไม่รู้อะ ไม่เห็นคุ้นเลย"
    py "เรื่องจุกจิกแบบนั้นหน่ะ ชั่งมันก่อนเถอะ"
    py "ฉันว่าพวกเรารีบไปHiveเถอะนะ"
    mc "ก็จริง"
    menu df0_next:
        "เดินตรงไป":
            scene black with slowdisslove
            call df1




