label df3_1:
    #mc = yuki py = pychan
    "ผมเดินมาซักพักผมก็เจอแมลงตัวแปลกๆ"
    mc "แมลงอะไรหน่ะ ไม่เคยเห็นมาก่อนแฮะ"
    py "ในฐานข้อมูลเบื้องต้นของLABMEMก็ไม่เจอนะ"
    py "อาจจะเป็นแมลงลึกลับหรือเป็น deadmeme ก็ได้"
    "เหมือนคุ้นๆเห็นเป็นกระแสในinternet อยู่นะ"
    py "จัดการซะ"
    mc "เอางั้นเลยนะ?"
    ##สู้ stickbug ##
    py "อ่อนแอชะมัด"
    py "แต่เก็บข้อมูลไว้แล้วแหละ ไปต่อเถอะ"
    "โลกนี้มันก็มีอะไรแบบนี้ด้วยสินะเนี่ย ถ้าเจอ smurf cat ก็ไม่แปลกใจละ"
    #choice 
    "เลี้ยวขวา"
