label df3_2:
    #mc = yuki py = pychan pl2 = ลูกกระจอก Project Prologue 2
    pl2 "หืมคนในLABMEMงั้นเรอะ"
    py "ทำไมมันพูดเหมือนกันคนเมื่อกี๊เลยอะ!?"
    "ลูกน้องProject Prologueจ้องมาที่ผม"
    "พวกนี้มันทำเพื่อเงินอย่างเดียวรึไงวะเนี่ย"
    pl2 "ในเมื่อพวกแกโผล่มาให้เห็นแล้ว ทีนี้ฉันจะจัดการพวกแก และพวกเราจะขโมยงานวิจัยโง่ๆนั่นอีกรอบซะ"
    mc "ทำไมพวกนี้อยากได้งานวิจัยขนาดนั้นเลยนะ?"
    py "ชั่งเรื่องนั้นไปก่อนเถอะน่า จัดการมันเหอะ!"

    ###สู้###
    
    py "มันหนีไปอีกละ"
    py "เอาละฉันว่าพวกเรารีบไปกันต่อเถอะ"
    "จะว่าไปเรายังสงสัยอยู่เลย"
    "ว่าถ้าพวกเราได้วิจัยสุดยอดสิ่งมีชีวิตจริงๆ พวกเราจะเอาไปทำอะไรกันนะ?"
    "และทำไมมีแต่พวก Project Prologue อยู่แถวนี้กัน?"
    py "เหมือนจะมีแยกทางอีกแล้วนะ ไปทางไหนดี?"
    ###choice###
        "เดินตรงไป":
            # call df0_fight
        "เลี้ยวขวา":
            # call df0_fight
    
