label df4:
    #mc = yuki py = pychan maid = yuri
    "ในที่สุดพวกเราก็เดินทางมาถึงหน้าฐานHive จนได้"
    "แต่บรรยากาศดูสงบแปลกๆ ไม่เหมือนกับมาเฟียHivemindที่เคยได้ยินอะนะ"
    py "ไม่ผิดแน่ คิดว่าน่าจะเป็นตรงนี้แหละ"
    mc "คิดว่า??? นี่เธอเป็นไกด์แน่หรอเนี่ย"
    py "ฉันสอนแค่ระบบต่อสู้เท่านั้นแหละ แต่นี่แหละHiveที่LEMONพูดถึง"
    mc "แล้วเราจะเข้าไปได้ไหมนะ"
    maid "มีฐุระอะไรหรือไม่เจ้าคะ?"
    "พอผมกำลังจะไปหันไปมอง เธอก็อยู่ตรงหน้าพวกเราแล้ว"
    maid "ดิฉันคือ ยูริ หัวหน้าเมดของคุณหนู Reine มีธุระอะไรก็บอกฉันได้เลยค่ะ ฉันจะนำทางไปให้"
    "Reine? หัวหน้ามาเฟียคนปัจจุบันนิ"
    "แถมเธอเหมือนถือตระเก้ามะนาวอยู่ข้างล่างรึป่าวนะ?"
    py "เมดหรอ? ปกตินึกว่ามาเฟียมีแต่คนโหดๆซะอีก"
    "ผมไม่ค่อยเห็นมาเฟียมีเมดเท่าไหร่นะ น่าแปลกแฮะ"
    mc "ผมมีเรื่องอยากจะคุยกับคุณ Reine หน่ะครับ ช่วยนำทางไปหน่อยได้ไหมครับ?"
    "ยูริมองผมด้วยรอยยิ้มเหมือนกำลังประเมินตัวผมซักพัก"
    maid "ฉันยินดีกับทุกคนที่จะเข้ามาหาคุณหนู Reine ทุกคนนั่นแหละค่ะ เมื่อกี๊ก็มีคนมาเหมือนกัน"
    py "หมายถึง LEMON รึป่าวนะ"
    maid "ต้องบอกว่าดิฉันดีใจมากที่คุณหนูจะมีแขกมาบ้าง"
    maid "แต่ว่า..."
    mc "???"
    maid "ดิฉันต้องเสียใจจริงๆ แต่ดิฉันคงให้คุณผ่านไปไม่ได้หรอกค่ะ"
    py "เอ๋!?"
    maid "งานของคุณหนูก็คืองานของดิฉัน การหยุดการวิจัยของพวกLABMEMก็เช่นกันค่ะ"
    maid "ฉันจะไม่ให้คุณหนูต้องเจ็บปวดอีกต่อไปแล้ว!"
    py "แย่แล้ว! ยังไงก็ต้องสู้สินะ เอาชนะให้ได้นะ!"
    mc "ช่วยไม่ได้นะครับ แต่ผมก็จะแพ้ไม่ได้เหมือนกัน!"

    ###สู้###

    maid "คุณนี่สุดยอดจริงๆนะคะ"
    maid "จริงๆแล้วคุณมาเก็บงานวิจัย DNA TrueString ของคุณหนูสินะคะ"
    mc "รู้ได้ไงหน่ะ"
    maid "การที่LABMEMมาที่นี่ นอกจากงานวิจัยแล้ว ยังจะมีอะไรอีกหล่ะคะ"
    "LABMEM ที่มาที่นี่ก็มาเพื่อวิจัยนี่นะ"
    maid "แต่เอาจริงๆแล้ว ดิฉันก็พอรู้อยู่แล้วแหละค่ะว่าพวกคุณก็ไม่ใช่คนเลวร้ายอะไรหรอก"
    maid "ฉันแค่ จำเป็น ต้องรับงานมาอีกที"
    mc "ให้ผมเดานะ พวก Project Prologue บอกคุณมางั้นหรอ?"
    maid "..."
    "ยูริพยายามยิ้มให้ผม เหมือนจะเริ่มกลบกลื่นไม่มิดแล้วแฮะ"
    "นั่นเหมือนจะไม่ใช้ยิ้มแห่งความสุข แต่ยิ้มตามปราสามารยาทของเมดที่*เหมือน*โดนบังคับฝึกมา"
    maid "หลังจากคุณพ่อของคุณหนูตาย คุณหนูก็ต้องมารับงานสกปรกแทนคุณพ่อที่ตายไป"
    maid "เพื่อนๆของคุณหนูที่โรงเรียนก็ล้อจนคุณหนูแทบจะไม่สามารถไปโรงเรียนได้"
    maid "ดิฉันกับคุณหนูพวกเราเติบโตมาด้วยกัน ในฐานะผู้สืบทอดHivemind และเมดประจำตัวคุณหนูตามที่สืบทอดกันมา"
    maid "พูดตรงๆดิฉันก็ไม่ชอบการทำงานของHivemindนี่หรอกค่ะ มันทำให้ดิฉันขยะแขยงด้วยซ้ำ"
    maid "คุณหนูนั้นจริงๆแล้วเป็นคนดีมาก พวกเราเข้าโลกแห่งนี้เพื่อproveว่าพวกเราเองก็เป็นคนดีได้เหมือนกัน"
    maid "ไหนพอเข้ามาในโลกจำลองแห่งนี้ พวกเราก็โดนขับไล่เพราะโดน *ใส่ร้าย* อีก"
    mc "ใส่ร้ายหรอ?"
    maid "จริงๆแล้ว คุณหนูไม่มีสิ่งที่คุณตามหาหรอกค่ะ"
    mc "!?"
    maid "อย่างที่บอก พวกเราโดนใส่ร้ายว่าขโมย True String จริงๆแล้ว True String ดิฉันคิดว่าน่าจะอยู่ที่อื่นค่ะ"
    py "นอกจากที่อื่น ก็เหลือแต่ข้างในสุดของ BlackDormForest แล้ว จะเชื่อได้จริงๆหรอ"
    py "ได้ยินมาว่าแถวนั้นอันตรายมากเลยนะ ถ้าเข้าไปแล้วอาจจะกลับมาไม่ได้อีก อย่าดีกว่า"
    maid "จะเชื่อดิฉันหรือไม่ก็ได้อันนี้ก็แล้วแต่คุณค่ะ แต่ถ้าไม่เชื่อ ดิฉันก็จะนำทางไปให้"
    ###choice###
    menu choice1:
        "เข้า HIVE":
            maid "รับทราบค่ะ ดิฉันจะนำทางไปให้"
            maid "จริงๆมีอีกเรื่องนึงค่ะ แต่เรื่องนั้นดิฉันว่าให้คุณหนูพูดเองดีกว่า"
            maid "ดิฉันเชื่อว่าคุณหนูต้องเปิดใจแน่นอนค่ะ เพราะว่าดิฉันรู้อยู่แล้วว่า คุณหนูเป็นคนดี"
            # call df0_fight
        "เลี้ยวขวา":
            py "เดี๋ยว นายแน่ใจแล้วหรอถ้าเข้าไปเข้าในสุด BlackDormForest ก็จะออกมาไม่ได้อีกเลยนะ!?"
            mc "เรามาที่นี่เพื่อทำภารกิจให้สำเร็จ เพราะงั้นไม่เป็นไรแน่"
            mc "อีกอย่างเราก็มีวิธีlogoutด้วยนิ ไม่เป็นไรหรอก"
            py "..."
            mc "งั้นเดี๋ยวผมไปทางอื่นละกันครับ"
            maid "รับทราบค่ะ งั้นดิฉันขอตัวก่อนนะคะ"
            "และ yuri ก็เดินจากไป"
            # call df0_fight




    
